/*
 * @Author: allen
 * @Date: 2023-08-11
 *
 * 02:二分法求函数的零点
 *
 * 总时间限制: 1000ms 内存限制: 65536kB
 *
 * 描述
 *     有函数：f(x) = x<sup>5</sup> - 15 * x<sup>4</sup>+ 85 * x<sup>3</sup>- 225 * x<sup>2</sup>+ 274 * x - 121已知 f(1.5) &gt; 0 , f(2.4) &lt; 0 且方程 f(x) = 0 在区间 [1.5,2.4] 有且只有一个根，请用二分法求出该根。

 *
 * 输入
 *     无。
 *
 * 输出
 *     该方程在区间[1.5,2.4]中的根。要求四舍五入到小数点后6位。
 *
 * 样例输入
 *     无
 *
 * 样例输出
 *     不提供
 *
 * 提示
 *      
 */
 
#include <iostream>
using namespace std;
 
int main(){
    
    return 0;
}