/*
 * @Author: allen
 * @Date: 2023-08-11
 *
 * 25:求特殊自然数
 *
 * 总时间限制: 1000ms 内存限制: 65536kB
 *
 * 描述
 *    一个十进制自然数,它的七进制与九进制表示都是三位数，且七进制与九进制的三位数码表示顺序正好相反。编程求此自然数,并输出显示.

 *
 * 输入
 *     无。
 *
 * 输出
 *     三行：
    第一行是此自然数的十进制表示；
    第二行是此自然数的七进制表示；
    第三行是此自然数的九进制表示。
 *
 * 样例输入
 *     （无）
 *
 * 样例输出
 *     （不提供）
 *
 * 提示
 *      
 */
 
#include <iostream>
using namespace std;
 
int main(){
    int a7, b7, c7;
    int a9, b9, c9;
    for (int n = 49; n <343; n++){
        a7 = n / 49;
        b7 = (n - a7 * 49) / 7;
        c7 = n - a7 * 49 - b7 * 7;
        a9 = c7;
        b9 = b7;
        c9 = a7;
        if (a9 * 81 + b9 * 9 + c9 == n){
            cout << n << endl;
            cout << a7 << b7 << c7 << endl;
            cout << a9 << b9 << c9 << endl;
        }
    }
        return 0;
}